app/controllers/api/v1/lists_controller.rb

    def index
      @lists = List.order(:id)
---
SELECT "lists".* FROM "lists" ORDER BY "lists"."id" ASC

    def create
      @list = List.new(list_params)
      if @list.save
---
INSERT INTO "lists" ("list_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["list_name", "Hey"], ["created_at", "2018-12-18 00:28:53.815572"], ["updated_at", "2018-12-18 00:28:53.815572"]]

      def get_list
        @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]