app/controllers/api/v1/names_controller.rb

    def create
      @name = Name.new(name_params)
      if @name.save
---
INSERT INTO "names" ("baby_name", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["baby_name", "Heya"], ["list_id", 8], ["created_at", "2018-12-17 22:36:54.882788"], ["updated_at", "2018-12-17 22:36:54.882788"]]

      def get_list
        @list = List.find(params[:list_id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]