app/controllers/api/v1/users_controller.rb

    def index
      @users = User.order(:id)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC

    def update
      if @user.update(user_params)
---
UPDATE "users" SET "recently_viewed_list" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["recently_viewed_list", 8], ["updated_at", "2018-12-18 10:55:35.350391"], ["id", 1]]

    def get_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]